qpacsystems/1704165-Bootloader/lib/cyclone_boot/drivers/flash/internal/stm32u5xx_flash_driver.c
/**
 * @file stm32u5xx_flash_driver.c
 * @brief CycloneBOOT STM32U5xx Flash Driver
 *
 * @section License
 *
 * Copyright (C) 2021-2026 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneBOOT Open
 * 
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.

 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.6.2
 **/

// Switch to the appropriate trace level
#define TRACE_LEVEL CBOOT_DRIVER_TRACE_LEVEL

// Dependencies
#include "stm32u5xx_flash_driver.h"

#include "core/flash.h"
#include "debug.h"
#include "stm32u5xx.h"
#include "stm32u5xx_hal.h"

// Sector list size
#define SECTORS_LIST_LEN 1

/**
 * @brief Sector group description
 **/

typedef struct
{
   uint32_t addr;
   uint32_t size;
   uint32_t nb;
} SectorsGroup;

// Internal flash memory sectors list
static const SectorsGroup sectorsList[SECTORS_LIST_LEN] = {
#ifndef FLASH_DB_MODE
   {STM32U5xx_FLASH_ADDR, STM32U5xx_FLASH_SECTOR_SIZE, STM32U5xx_FLASH_SECTOR_NUMBER}
#else
   {STM32U5xx_FLASH_ADDR, STM32U5xx_FLASH_SECTOR_SIZE, STM32U5xx_FLASH_SECTOR_NUMBER}
#endif
};

// Memory driver private related functions
error_t stm32u5xx_flash_driver_init(void);
error_t stm32u5xx_flash_driver_deinit(void);
error_t stm32u5xx_flash_driver_get_info(const FlashInfo **info);
error_t stm32u5xx_flash_driver_get_status(FlashStatus *status);
error_t stm32u5xx_flash_driver_write(uint32_t address, uint8_t *data, size_t length);
error_t stm32u5xx_flash_driver_read(uint32_t address, uint8_t *data, size_t length);
error_t stm32u5xx_flash_driver_erase(uint32_t address, size_t length);
error_t stm32u5xx_flash_driver_swap_banks(void);
error_t stm32u5xx_flash_driver_get_next_sector_address(uint32_t address, uint32_t *sectorAddr);
bool_t stm32u5xx_flash_driver_is_sector_address(uint32_t address);

error_t stm32u5xxFlashDriverWriteQuadWord(uint32_t address, uint32_t quadWord);
int_t stm32u5xxFlashGetSector(uint32_t address);
error_t stm32u5xxFlashDriverEraseSector(uint32_t bankID, uint32_t firstSector, size_t nbSectors);
error_t flashGetCurrentBank(uint8_t *fBankID);
error_t stm32u5xxFlashDriverGetNextSector(uint32_t address, uint32_t *sectorAddr);

///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////

/**
 * @brief Memory Information
 **/

const FlashInfo stm32u5xx_flash_driver_info = {.version = FLASH_DRIVER_VERSION,
                                               .flashName = STM32U5xx_FLASH_NAME,
                                               .flashType = FLASH_TYPE_INTERNAL,
                                               .flashAddr = STM32U5xx_FLASH_ADDR,
                                               .flashSize = STM32U5xx_FLASH_SIZE,
                                               .writeSize = STM32U5xx_FLASH_WRITE_SIZE,
                                               .readSize = STM32U5xx_FLASH_READ_SIZE,
#ifndef FLASH_DB_MODE
                                               .dualBank = 0,
                                               .bankSize = 0,
                                               .bank1Addr = 0,
                                               .bank2Addr = 0,
                                               .flags = 0
#else
                                               .dualBank = 1,
                                               .bankSize = STM32U5xx_FLASH_BANK_SIZE,
                                               .bank1Addr = STM32U5xx_FLASH_ADDR,
                                               .bank2Addr =
                                                  STM32U5xx_FLASH_ADDR + STM32U5xx_FLASH_BANK_SIZE,
                                               .flags = 0
#endif
};

/**
 * @brief stm32u5xx Flash driver
 **/

const FlashDriver stm32u5xxFlashDriver = {
   .init = stm32u5xx_flash_driver_init,
   .deInit = stm32u5xx_flash_driver_deinit,
   .getInfo = stm32u5xx_flash_driver_get_info,
   .getStatus = stm32u5xx_flash_driver_get_status,
   .write = stm32u5xx_flash_driver_write,
   .read = stm32u5xx_flash_driver_read,
   .erase = stm32u5xx_flash_driver_erase,
#ifdef FLASH_DB_MODE
   .swapBanks = stm32u5xx_flash_driver_swap_banks,
#endif
   .getNextSectorAddr = stm32u5xx_flash_driver_get_next_sector_address,
   .isSectorAddr = stm32u5xx_flash_driver_is_sector_address,
};

///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////

/**
 * @brief Initialize Flash Memory.
 * @return Error code
 **/

error_t stm32u5xx_flash_driver_init(void)
{
   // Debug message
   TRACE_INFO("Initializing %s memory...\r\n", STM32U5xx_FLASH_NAME);

   // Wait for last flash operation on flash bank 1
   FLASH_WaitForLastOperation(50);
   // Clear all flash bank 1 flags
   __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS);

#if defined(FLASH_DB_MODE)
   // Wait for last flash operation on flash bank 2
   FLASH_WaitForLastOperation(50);
   // Clear all flash bank 2 flags
   __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS);
#endif

   // Successfull process
   return NO_ERROR;
}

/**
 * @brief De-Initialize Flash Memory.
 * @return Error code
 **/

error_t stm32u5xx_flash_driver_deinit(void)
{
   // Successfull process
   return NO_ERROR;
}

/**
 * @brief Get Flash Memory information.
 * @param[in,out] info Pointeur to the Memory information structure to be
 * returned
 * @return Error code
 **/

